from generator import generate_answer


question = "मैनहट्टन परियोजना की सफलता का तुरंत क्या प्रभाव पड़ा?"


context = """
[Source 1]
मैनहट्टन परियोजना और इसके परमाणु बम ने द्वितीय विश्व युद्ध को समाप्त करने में मदद की। इसके परमाणु ऊर्जा के शांतिपूर्ण उपयोग की विरासत का प्रभाव इतिहास और विज्ञान पर जारी है।

[Source 2]
वैज्ञानिक दिमाग के बीच संचार की उपस्थिति मैनहट्टन परियोजना की सफलता के लिए उतनी ही महत्वपूर्ण थी जितनी कि वैज्ञानिक बुद्धिमत्ता थी। परमाणु शोधकर्ताओं और इंजीनियरों की प्रभावशाली उपलब्धि पर लटकता एकमात्र बादल उनकी सफलता का वास्तव में क्या अर्थ था; सैकड़ों हजारों निर्दोष जीवन का विनाश।

[Source 3]
मैनहट्टन परियोजना द्वितीय विश्व युद्ध के दौरान एक अनुसंधान और विकास उपक्रम था जिसने पहले परमाणु हथियारों का निर्माण किया था।
"""


print("Generating answer...\n")


answer = generate_answer(
    question,
    context
)


print("=" * 70)
print("GENERATED ANSWER")
print("=" * 70)

print(answer)